appetizers/crab_rangoons.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-08 Sat 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Crab Rangoon Recipe</title>
<meta name="author" content="Matthew Younger" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Crab Rangoon Recipe</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org92b08e1">1. Sweet chili dipping sauce:</a>
<ul>
<li><a href="#org2a60ec0">1.1. Ingredients</a></li>
<li><a href="#orgb14049c">1.2. Instructions</a></li>
</ul>
</li>
<li><a href="#org08dfc6a">2. For the crab rangoon:</a>
<ul>
<li><a href="#org5769445">2.1. Ingredients</a></li>
<li><a href="#orgd69e9ee">2.2. Instructions</a>
<ul>
<li><a href="#orgef22fe6">2.2.1. Combine filling</a></li>
<li><a href="#org52f2442">2.2.2. Assemble rangoons</a></li>
<li><a href="#org8201e9c">2.2.3. Fry the rangoons</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Serves: 12
</p>

<p>
Prep time: 35 minutes
Cook time: 20 minutes
</p>
<div id="outline-container-org92b08e1" class="outline-2">
<h2 id="org92b08e1"><span class="section-number-2">1.</span> Sweet chili dipping sauce:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2a60ec0" class="outline-3">
<h3 id="org2a60ec0"><span class="section-number-3">1.1.</span> Ingredients</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>1 cup water</li>
<li>1 tablespoon rice vinegar</li>
<li>3 tablespoons ketchup</li>
<li>3 tablespoons sugar</li>
<li>1 tablespoon sambal oelek</li>
<li>3 garlic cloves, minced</li>
<li>1 tablespoon cornstarch</li>
<li>3 tablespoons water</li>
</ul>
</div>
</div>
<div id="outline-container-orgb14049c" class="outline-3">
<h3 id="orgb14049c"><span class="section-number-3">1.2.</span> Instructions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In a saucepan over medium heat, place in the water, rice vinegar, ketchup, sugar, sambal oelek, and garlic.
Bring it to a simmer, and pour in the cornstarch slurry (1 tablespoon of cornstarch and 3 tablespoons of water). Stir until it is thickened. Set aside.
</p>
</div>
</div>
</div>
<div id="outline-container-org08dfc6a" class="outline-2">
<h2 id="org08dfc6a"><span class="section-number-2">2.</span> For the crab rangoon:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5769445" class="outline-3">
<h3 id="org5769445"><span class="section-number-3">2.1.</span> Ingredients</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>12 wonton wrappers</li>
<li>8 ounces Philadelphia cream cheese</li>
<li>1 1/2 cups crab meat, minced</li>
<li>2 stalk scallions, minced</li>
<li>1 tablespoon soy sauce</li>
<li>1/2 teaspoon sugar</li>
<li>Pinch of white pepper</li>
<li>4 cups extra light olive oil, for frying</li>
</ul>
</div>
</div>
<div id="outline-container-orgd69e9ee" class="outline-3">
<h3 id="orgd69e9ee"><span class="section-number-3">2.2.</span> Instructions</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgef22fe6" class="outline-4">
<h4 id="orgef22fe6"><span class="section-number-4">2.2.1.</span> Combine filling</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
In a mixing bowl, combine the Philadelphia cream cheese, crab meat, scallions, soy sauce, sugar, and white pepper. Mix together.
</p>
</div>
</div>
<div id="outline-container-org52f2442" class="outline-4">
<h4 id="org52f2442"><span class="section-number-4">2.2.2.</span> Assemble rangoons</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Tap some water on the edges of the wrapper. Place about 1 1/2 teaspoons of filling in the center.
Fold the two ends of the wrapper together, followed by the other two ends, and seal all the edges to form a four-pointed star.
</p>
</div>
</div>
<div id="outline-container-org8201e9c" class="outline-4">
<h4 id="org8201e9c"><span class="section-number-4">2.2.3.</span> Fry the rangoons</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
In a large pot over high heat, place in the extra light olive oil (or other high smoking point oil of your choice), and heat it to 325°F or 163°C.
Transfer in the crab rangoon, a few at a time. Deep fry until golden brown for about 5 minutes, and turn them frequently so that they brown evenly.
Remove and drain on a paper towel-lined plate. Repeat with the remaining crab rangoon. Serve!
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Younger</p>
<p class="date">Created: 2025-02-08 Sat 12:47</p>
</div>
</body>
</html>
